from .config import AGE_FROM, AGE_TO


hello = 'Привееет, {} 👋\n\n' \
        'Нажми на кнопку "Поиск 🔎"'

service_not_available = 'Извините сервис пока недоступен 😢'

init_search = 'Итак, {}, сейчас посмотрю твой профиль и подберу тебе пару.\n\n' \
              'Если будет не хватать каких-то данных, я у тебя их запрошу!'
searching = '🕵️ Идет поиск, пожалуйста подождите...'
send_age = '🔢 Отправьте свой возраст.'
send_city = '🌃 Отправьте свой город.'
search_options = 'Ищем пару по таким данным:\n' \
                 '🌃 Город - {0}\n' \
                 '🔢 Возраст - {1}\n' \
                 '👐 Пол - {2}\n' \
                 '👨‍👩‍👧‍👦 Семейное положение - {3}'
end_search = 'К сожалению больше в поиске никого нет 😢'
unfamiliar_city = '🌁 Я не знаю такого города, попробуйте заново...'
send_only_numbers = '🔢 Отправь только ци-фо-ры, я программа тупенькая, я тебя не понимать 🫤'
age_limit = f'🔞 Тут возрастное ограничение от {AGE_FROM} до {AGE_TO} лет.\n'

not_found = 'Никого не найдено 😕\n'
